[options]
mode prove
depth 5

[engines]
smtbmc

[script]
#  0 Function generator             : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_function_generator
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_function_generator/wrapper.v
read -sv rtl/wrapped_function_generator/function_generator/src/generator.v

prep -top wrapped_function_generator
flatten

design -stash wrapped_function_generator
# end
# 12 CPR                            : /home/matt/work/asic-workshop/shuttle5/openlane/designs/cpr
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/cpr/wrapper.v
read -sv rtl/cpr/cpr/src/cpr.v

prep -top wrapped_cpr
flatten

design -stash wrapped_cpr
# end
#  2 instrumented adder - behavioural : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_instrumented_adder
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_instrumented_adder/wrapper.v
read -sv rtl/wrapped_instrumented_adder/instrumented_adder/src/instrumented_adder.v

prep -top wrapped_instrumented_adder_behav
flatten

design -stash wrapped_instrumented_adder_behav
# end
#  3 instrumented adder - sklansky  : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_instrumented_adder_sklansky
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_instrumented_adder_sklansky/wrapper.v
read -sv rtl/wrapped_instrumented_adder_sklansky/instrumented_adder/src/instrumented_adder.v
read -sv rtl/wrapped_instrumented_adder_sklansky/instrumented_adder/src/sklansky.v

prep -top wrapped_instrumented_adder_sklansky
flatten

design -stash wrapped_instrumented_adder_sklansky
# end
#  4 instrumented adder - Brent Kung : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_instrumented_adder_brent
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_instrumented_adder_brent/wrapper.v
read -sv rtl/wrapped_instrumented_adder_brent/instrumented_adder/src/instrumented_adder.v
read -sv rtl/wrapped_instrumented_adder_brent/instrumented_adder/src/brent_kung.v

prep -top wrapped_instrumented_adder_brent
flatten

design -stash wrapped_instrumented_adder_brent
# end
#  5 instrumented adder - Ripple carry : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_instrumented_adder_ripple
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_instrumented_adder_ripple/wrapper.v
read -sv rtl/wrapped_instrumented_adder_ripple/instrumented_adder/src/instrumented_adder.v
read -sv rtl/wrapped_instrumented_adder_ripple/instrumented_adder/src/ripple_carry.v

prep -top wrapped_instrumented_adder_ripple
flatten

design -stash wrapped_instrumented_adder_ripple
# end
#  6 instrumented adder - Kogge Stone : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_instrumented_adder_kogge
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_instrumented_adder_kogge/wrapper.v
read -sv rtl/wrapped_instrumented_adder_kogge/instrumented_adder/src/instrumented_adder.v
read -sv rtl/wrapped_instrumented_adder_kogge/instrumented_adder/src/kogge_stone.v

prep -top wrapped_instrumented_adder_kogge
flatten

design -stash wrapped_instrumented_adder_kogge
# end
#  8 Wavelet Transform              : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_wavelet_transform
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_wavelet_transform/wrapper.v
read -sv rtl/wrapped_wavelet_transform/wavelet_transform/src/wavelet_transform.v
read -sv rtl/wrapped_wavelet_transform/wavelet_transform/src/shift_register_line.v
read -sv rtl/wrapped_wavelet_transform/wavelet_transform/src/fir.v
read -sv rtl/wrapped_wavelet_transform/wavelet_transform/src/output_multiplexer.v

prep -top wrapped_wavelet_transform
flatten

design -stash wrapped_wavelet_transform
# end
#  7 PrimitiveCalculator            : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_PrimitiveCalculator
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_PrimitiveCalculator/wrapper.v
read -sv rtl/wrapped_PrimitiveCalculator/PrimitiveCalculator_/src/ClockDivider.v
read -sv rtl/wrapped_PrimitiveCalculator/PrimitiveCalculator_/src/Debouncer.v
read -sv rtl/wrapped_PrimitiveCalculator/PrimitiveCalculator_/src/HexSevenSegmentDecoder.v
read -sv rtl/wrapped_PrimitiveCalculator/PrimitiveCalculator_/src/PrimitiveALU.v
read -sv rtl/wrapped_PrimitiveCalculator/PrimitiveCalculator_/src/PrimitiveCalculator.v
read -sv rtl/wrapped_PrimitiveCalculator/PrimitiveCalculator_/src/RotaryEncoder.v

prep -top wrapped_PrimitiveCalculator
flatten

design -stash wrapped_PrimitiveCalculator
# end
#  9 snn-accelerator                : /home/matt/work/asic-workshop/shuttle5/openlane/designs/snn-accelerator
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/snn-accelerator/wrapper.v
read -sv rtl/snn-accelerator/src/clk_div.v
read -sv rtl/snn-accelerator/src/neuron_2x.v
read -sv rtl/snn-accelerator/src/neuron_4x.v
read -sv rtl/snn-accelerator/src/neuron_8x.v
read -sv rtl/snn-accelerator/src/neuron_slow.v
read -sv rtl/snn-accelerator/src/neuron.v
read -sv rtl/snn-accelerator/src/out_neuron.v
read -sv rtl/snn-accelerator/src/wrapped_snn.v

prep -top wrapped_snn
flatten

design -stash wrapped_snn
# end
# 13 scan chain test                : /home/matt/work/asic-workshop/shuttle5/openlane/designs/wrapped_scan_test
read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wrapped_scan_test/wrapper.v
read -sv rtl/wrapped_scan_test/scan_test/scan_wrapper.v
read -sv rtl/wrapped_scan_test/scan_test/mini_design.v

prep -top wrapped_scan_test
flatten

design -stash wrapped_scan_test
# end

#shared

read -noverific
read -sv defines.v
read -define FORMAL_COMPAT

read -sv rtl/wb_bridge/src/wb_bridge_2way.v
read -sv rtl/wb_openram_wrapper/src/register_rw.v
read -sv rtl/wb_openram_wrapper/src/wb_port_control.v
read -sv rtl/wb_openram_wrapper/src/wb_openram_wrapper.v
read -sv rtl/openram_z2a/src/sky130_sram_1kbyte_1rw1r_32x256_8.v

read -define FORMAL
read -sv rtl/user_project_wrapper.v

design -import wrapped_function_generator
design -import wrapped_cpr
design -import wrapped_instrumented_adder_behav
design -import wrapped_instrumented_adder_sklansky
design -import wrapped_instrumented_adder_brent
design -import wrapped_instrumented_adder_ripple
design -import wrapped_instrumented_adder_kogge
design -import wrapped_wavelet_transform
design -import wrapped_PrimitiveCalculator
design -import wrapped_snn
design -import wrapped_scan_test

prep -top user_project_wrapper

flatten; tribuf -formal

[files]
verilog/rtl
caravel/verilog/rtl/defines.v
